
** Script.py

#+begin_src python :results output
import pandas as pd
from scipy.stats import chi2_contingency

data = pd.read_csv("ab_data.csv")
print(data.head())

# calculate contingency table here
ab_contingency = pd.crosstab(data.Web_Version, data.Purchased)
print(ab_contingency)

# run your chi square test here
chi2, pval, dof, expected = chi2_contingency(ab_contingency)
print(pval)

#+end_src

#+RESULTS:
#+begin_example
  Web_Version Purchased
0           A        no
1           A        no
2           A       yes
3           A       yes
4           A       yes
Purchased    no  yes
Web_Version         
A            24   26
B            15   35
0.10096676200907678
#+end_example

** Script.py

#+begin_src python :results output
import numpy as np
import pandas as pd

sample_size = 4
lift = .3
control_rate = .5
name_rate = (1 + lift) * control_rate

sample_control = np.random.choice(['yes', 'no'], size=int(sample_size/2), p=[control_rate,1-control_rate])
sample_name = np.random.choice(['yes', 'no'], size=int(sample_size/2), p=[name_rate, 1-name_rate])

group = ['control']*int(sample_size/2) + ['name']*int(sample_size/2)
outcome = list(sample_control) + list(sample_name)
sim_data = {"Button": group, "Opened": outcome}
sim_data = pd.DataFrame(sim_data)
print(sim_data)
#+end_src

#+RESULTS:
:     Button Opened
: 0  control     no
: 1  control     no
: 2     name     no
: 3     name     no

** Script.py

#+begin_src python :results output
import numpy as np
import pandas as pd
from scipy.stats import chi2_contingency

# pre-set values
significance_threshold = 0.05
sample_size = 100
lift = .3
control_rate = .5
name_rate = (1 + lift) * control_rate

# simulate a dataset
sample_control = np.random.choice(['yes', 'no'], size=int(sample_size/2), p=[control_rate,1-control_rate])
sample_name = np.random.choice(['yes', 'no'], size=int(sample_size/2), p=[name_rate, 1-name_rate])

group = ['control']*int(sample_size/2) + ['name']*int(sample_size/2)
outcome = list(sample_control) + list(sample_name)
sim_data = {"Email": group, "Opened": outcome}
sim_data = pd.DataFrame(sim_data)

# run a chi-square test
ab_contingency = pd.crosstab(np.array(sim_data.Email), np.array(sim_data.Opened))
chi2, pval, dof, expected = chi2_contingency(ab_contingency, correction=False)
print("P Value:")
print(pval)

# determine significance here:
result = ('significant' if pval < 0.05 else 'not significant')

print("Result:")
print(result)

#+end_src

#+RESULTS:
: P Value:
: 0.42333964158244364
: Result:
: not significant
